#+title: Lektion 3
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup


| [[./index.org][Kursöversikt]] | [[./lektion1.org][Lektion 1]] | [[./lektion2.org][Lektion 2]] | [[./lektion3.org][Lektion 3]]  |

* IP-adresser
Vi snackar IPv4, 32bit men brukar skrivas i decimal punktform:
\( 1100\ 0001\ \  0000\ 1100\ \ 0101\ 1011\ \ 0001\  1111 = 193.12.91.31 \)

består av två delar

- Nätverksadress Nät-ID, specificerar vilket nätverk de tillhör. Alltså subnät,
  routrar kopplar ihop dem.
- Host-ID, dator man själv är.

** klasslösa adresser, subnetting
Idag används subnetting och klasslösa adresser.
Exempel IP-masken 255.255.0.0 = FFFF0000
Alltså från net-id och host-id till site, subnet-id, host-id

Reserverade adresser:
- Network addresses, alla hostar är 0
- Broadcast addresses, alla hostar är 1
- Host på detta nätverk, alla i nätverk är 0
- 10.0.0.0 till 10.255.255.255 för NAT
- 172.16.0.0 till 172.31.255.255 för NAT
- 192.168.0.0 192.168.255.255 för NAT

*** /-notation
hur många 1or den börjar på

*11111111 11111111* _00000000 00000000_ /16

*11111111 11111111* /111/ _00000 00000000_ /19

*Nät-id*

/Subnet/

_Host-id_

#+begin_src shell :results output
ifconfig
#+end_src

#+RESULTS:
#+begin_example
lo0: flags=8049<UP,LOOPBACK,RUNNING,MULTICAST> mtu 16384
	options=1203<RXCSUM,TXCSUM,TXSTATUS,SW_TIMESTAMP>
	inet 127.0.0.1 netmask 0xff000000
	inet6 ::1 prefixlen 128
	inet6 fe80::1%lo0 prefixlen 64 scopeid 0x1
	nd6 options=201<PERFORMNUD,DAD>
gif0: flags=8010<POINTOPOINT,MULTICAST> mtu 1280
stf0: flags=0<> mtu 1280
ap1: flags=8802<BROADCAST,SIMPLEX,MULTICAST> mtu 1500
	options=400<CHANNEL_IO>
	ether 2a:f8:bc:6d:03:73
	media: autoselect
	status: inactive
en0: flags=8863<UP,BROADCAST,SMART,RUNNING,SIMPLEX,MULTICAST> mtu 1500
	options=6463<RXCSUM,TXCSUM,TSO4,TSO6,CHANNEL_IO,PARTIAL_CSUM,ZEROINVERT_CSUM>
	ether 08:f8:bc:6d:03:73
	inet6 fe80::1493:4c9f:5622:f470%en0 prefixlen 64 secured scopeid 0x6
	inet 10.82.225.127 netmask 0xffffe000 broadcast 10.82.255.255
	nd6 options=201<PERFORMNUD,DAD>
	media: autoselect
	status: active
en1: flags=8963<UP,BROADCAST,SMART,RUNNING,PROMISC,SIMPLEX,MULTICAST> mtu 1500
	options=460<TSO4,TSO6,CHANNEL_IO>
	ether 82:bd:83:87:4c:01
	media: autoselect <full-duplex>
	status: inactive
en2: flags=8963<UP,BROADCAST,SMART,RUNNING,PROMISC,SIMPLEX,MULTICAST> mtu 1500
	options=460<TSO4,TSO6,CHANNEL_IO>
	ether 82:bd:83:87:4c:00
	media: autoselect <full-duplex>
	status: inactive
bridge0: flags=8863<UP,BROADCAST,SMART,RUNNING,SIMPLEX,MULTICAST> mtu 1500
	options=63<RXCSUM,TXCSUM,TSO4,TSO6>
	ether 82:bd:83:87:4c:01
	Configuration:
		id 0:0:0:0:0:0 priority 0 hellotime 0 fwddelay 0
		maxage 0 holdcnt 0 proto stp maxaddr 100 timeout 1200
		root id 0:0:0:0:0:0 priority 0 ifcost 0 port 0
		ipfilter disabled flags 0x0
	member: en1 flags=3<LEARNING,DISCOVER>
	        ifmaxaddr 0 port 7 priority 0 path cost 0
	member: en2 flags=3<LEARNING,DISCOVER>
	        ifmaxaddr 0 port 8 priority 0 path cost 0
	nd6 options=201<PERFORMNUD,DAD>
	media: <unknown type>
	status: inactive
awdl0: flags=8943<UP,BROADCAST,RUNNING,PROMISC,SIMPLEX,MULTICAST> mtu 1500
	options=400<CHANNEL_IO>
	ether e2:d7:06:ff:0f:77
	inet6 fe80::e0d7:6ff:feff:f77%awdl0 prefixlen 64 scopeid 0xa
	nd6 options=201<PERFORMNUD,DAD>
	media: autoselect
	status: active
llw0: flags=8863<UP,BROADCAST,SMART,RUNNING,SIMPLEX,MULTICAST> mtu 1500
	options=400<CHANNEL_IO>
	ether e2:d7:06:ff:0f:77
	inet6 fe80::e0d7:6ff:feff:f77%llw0 prefixlen 64 scopeid 0xb
	nd6 options=201<PERFORMNUD,DAD>
	media: autoselect
	status: active
utun0: flags=8051<UP,POINTOPOINT,RUNNING,MULTICAST> mtu 1380
	inet6 fe80::339d:9b4e:f8a:cb29%utun0 prefixlen 64 scopeid 0xc
	nd6 options=201<PERFORMNUD,DAD>
utun1: flags=8051<UP,POINTOPOINT,RUNNING,MULTICAST> mtu 2000
	inet6 fe80::fadb:4c75:9565:12da%utun1 prefixlen 64 scopeid 0xd
	nd6 options=201<PERFORMNUD,DAD>
utun2: flags=8051<UP,POINTOPOINT,RUNNING,MULTICAST> mtu 1000
	inet6 fe80::ce81:b1c:bd2c:69e%utun2 prefixlen 64 scopeid 0xe
	nd6 options=201<PERFORMNUD,DAD>
utun3: flags=8051<UP,POINTOPOINT,RUNNING,MULTICAST> mtu 1380
	inet6 fe80::4379:7fb1:f4ab:d4f%utun3 prefixlen 64 scopeid 0xf
	nd6 options=201<PERFORMNUD,DAD>
utun4: flags=8051<UP,POINTOPOINT,RUNNING,MULTICAST> mtu 1380
	inet6 fe80::f312:eb08:1a41:55ac%utun4 prefixlen 64 scopeid 0x10
	nd6 options=201<PERFORMNUD,DAD>
utun5: flags=8051<UP,POINTOPOINT,RUNNING,MULTICAST> mtu 1380
	inet6 fe80::b3:7d9b:4ae:6071%utun5 prefixlen 64 scopeid 0x11
	nd6 options=201<PERFORMNUD,DAD>
utun6: flags=8051<UP,POINTOPOINT,RUNNING,MULTICAST> mtu 1380
	inet6 fe80::95cf:ddf8:34c8:1713%utun6 prefixlen 64 scopeid 0x12
	nd6 options=201<PERFORMNUD,DAD>
utun7: flags=8051<UP,POINTOPOINT,RUNNING,MULTICAST> mtu 1380
	inet6 fe80::3864:1e76:aa89:7ea4%utun7 prefixlen 64 scopeid 0x13
	nd6 options=201<PERFORMNUD,DAD>
utun8: flags=8051<UP,POINTOPOINT,RUNNING,MULTICAST> mtu 1380
	inet6 fe80::5d31:c34e:c3b5:d059%utun8 prefixlen 64 scopeid 0x14
	nd6 options=201<PERFORMNUD,DAD>
en3: flags=8863<UP,BROADCAST,SMART,RUNNING,SIMPLEX,MULTICAST> mtu 1500
	ether ac:de:48:00:11:22
	inet6 fe80::aede:48ff:fe00:1122%en3 prefixlen 64 scopeid 0x4
	nd6 options=201<PERFORMNUD,DAD>
	media: autoselect (100baseTX <full-duplex>)
	status: active
#+end_example
